Revit 2027 API
Plane Methods
The Plane type exposes the following members.
Methods
Name | Description
Create |  Creates a Plane object defined by a local frame of reference.
CreateByNormalAndOrigin |  Constructs a Plane object from a normal and an origin represented as XYZ objects. Follows the standard conventions for a planar surface. The constructed Plane object will pass through origin and be perpendicular to normal. The X and Y axes of the plane will be defined arbitrarily.
CreateByOriginAndBasis |  Creates a Plane object defined by the two orthogonal unit vectors and passing through the origin point supplied as arguments.
CreateByThreePoints |  Creates a Plane object passing through three points supplied as arguments.
Dispose
(Inherited from Surface)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBoundingBoxUV |  Gets the UV bounding box of the surface.
(Inherited from Surface)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCoincidentWith |  Determine if two surfaces are coincident (ignoring Envelopes). For an affirmative answer, the surfaces must have the same type (e.g., two planes).
(Inherited from Surface)
Project |  Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails.
(Inherited from Surface)
ProjectWithGuessPoint |  Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails.
(Inherited from Surface)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Plane Class
Autodesk.Revit.DB Namespace